<template>
  <view class="title">{{ index === 0 ? "用户注册协议" : "隐私政策" }}</view>
  <view class="content" v-if="index === 0">
    <view>
      在此特别提醒您在注册成为《零碳小精灵》用户之前，请认真阅读本《零碳小精灵用户注册协议》(以下简称“协议")，确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。您同意并点击确认本协议条款完成注册程序后，才能成为《零碳小精灵》的正式注册用户，并享受《零碳小精灵》的各类服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。若您不同意本协议，或对本协议中的条款存在任何疑问，请您立即停止《零碳小精灵》用户注册程序，并可以选择不使用《零碳小精灵》服务。本协议条款是公司(以下称“我们")对用户相关政策的许诺，请您务必仔细阅读。
    </view>
    <view>1.用户信息</view>
    <view
      >采集当您在本小程序进行用户注册登记，使用本小程序的服务，以及参加本小程序的活动时，即为您同意本小程序将收集您的个人信息，并保存记录。本小程序收集的个人信息包括但不限于:微信昵称、头像、城市、地理位置、电子邮箱地址、手机号码、收货地址等。您主动提供的信息越多及越准确，我们就能够更好地为您提供有关服务。</view
    >
    <view>2.用户信息的使用</view>
    <view
      >本小程序收集个人信息的基本目的是更好地了解我们的用户，以便向您提供特色服务和个性化服务。个人信息将主要用于以下几个目的:</view
    >
    <view
      >(1)完成您对特定服务或产品的要求。(2)在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途确保我们向您提供的产品和服务的安全性。(3)帮助我们设计新服务，改善我们现有服务。(4)使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如位置设定、个性化的帮助服务和指示，或对您和其他用户作出其他方面的回应。(5)用于对本数据的统计(如用户数量、构成、兴趣、表现等)，以便我们向用户提供更好的服务和产品，或向第三方为了一定的合法目的披露该类统计数据。该类统计数据都是用户群整体的信息，而非个人的信息。(6)让您参与有关我们产品和服务的调查。为了让您有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过某一项服务所收集的信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的信息，可能在另一服务中用于向您提供特定内容，或向您展示与您相关的、非普遍推送的信息。如果我们在相关服务中提供了相应选项，您也可以授权我们将该服务所提供和储存的信息用于我们的其他服务。</view
    >
    <view>3.用户信息的共享和披露</view>
    <view
      >本小程序信息所收集您的个人信息，将仅用于《零碳小精灵》为您提供相关服务。一般情况下，在未得到您的同意之前，您的任何个人信息将不会被提供给无关的第三方。在下列情况下，我们可能会将您的个人信息提供给有关的第三方:(1)本小程序的某些服务需由一个合作伙伴(如代理公司、提供相关技术服务的公司、运输公司、邮寄公司、提供奖品的公司等)提供或共同提供。为了向您提供此类服务，本程序有必要与该合作伙伴分享您的个人信息。如果您不希望你的信息被分享，你可以不使用该具体服务从而拒绝您的个人信息被披露。(2)本小程序可能会与第三方共同进行推广活动。在推广活动中所收集的全部或部分个人信息可能会与该第三方分享。如果您不想让您的信息被分享，您可以通过不参加该推广活动而拒绝。(3)根据法律法规或政府的强制性规定，我们必须向有关司法或政府部门提供您的个人信息。(4)为了防止他人的合法权益或社会公共利益受到重大危害。(5)为了防止您的合法权益受到重大危害。(6)我们发现您的行为违反了本小程序的服务条款或关于特定服务或产品的任何使用指引，或对《零碳小精灵》小程序信息的合法权益构成重大危害。</view
    >
    <view>4.用户管理</view>
    <view
      >您可以在任何时候通过使用本小程序的个人中心，查询，补充或更正您的本小程序中的个人信息，或要求删除您的本小程序账户中的个人信息。您在本小程序的账户可以被删除，但这样会导致您不能够登录本小程序及使用本小程序的任何服务。若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本小程序并向公安机关报案。因用户未妥善保管其账号名称及密码而导致第三人使用账号而给用户造成的损失，由用户自行承担。用户在注册及使用时应承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，且用户对其发布的内容(包括但不限于文字图片等)时，不得有以下情形:(1)违反宪法或法律法规规定的;(2)危害国家安全泄露国家秘密，颠覆国家政权，破坏国家统一的;(3)损害国家荣誉和利益的，损害公共利益的;(4)煽动民族仇恨、民族歧视，破坏民族团结的;(5)破坏国家宗教政策，宣扬邪教和封建迷信的;(6)散布谣言，扰乱社会秩序，破坏社会稳定的;(7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的;(8)侮辱或者诽谤他人，侵害他人合法权益的;(9)含有法律、行政法规禁止的其他内容或违反《零碳小精灵》的其他规定的用户以虚假信息骗取账号名称注册，或其账号头像、昵称等注册信息存在违法和不良信息的，《零碳小精灵》有权采取通知限期改正，暂停使用、注销登记等措施。《零碳小精灵》账号仅限于用户本人使用，严禁将您的《零碳小精灵》账号允许第三人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。</view
    >
    <view>5.服务内容</view>
    <view
      >(1)本小程序提供减碳量数据记录服务，用户可通过参与低碳场景或点位项目获得零碳积分，参与小程序内各种公益活动，或换取相应兑换权益。(2)本小程序提供兑换真实权益服务，用户可将零碳积分兑换成各类真实权益，例如电子勋章、实物勋章等。</view
    >
    <view
      >6.信息安全您有责任妥善保管本软件帐号信息、帐号密码，并需要对帐号下一切行为承担法律责任。我们建议您不要向任何他人泄露您的密码。本小程序也不会主动致电或主动发电子邮件给您来询问您的密码，如果您遇到此类情况请及时与《零碳小精灵》客服联系确认。任何通过互联网或无线网络的数据传输都无法获得绝对的安全保证。所以，在我们尽最大努力来保护您的个人信息的同时，本小程序不能对您向我们进行的信息传输，或我们所发的在线产品或服务的信息的安全作出肯定或保证。您作出上述行为时将自己承担风险，一旦我们收到您传输来的信息，我们将尽最大努力保证其在我们系统的安全。</view
    >
    <view
      >7.用户隐私制度我们会在您自愿的前提下收集您的个人信息并将这些信息进行整合，包括但不限于注册账号时的相关信息和活动报名信息等。尊重用户个人隐私是《零碳小精灵》的一项基本政策。所以，《零碳小精灵》不会公开或向任何第三方透露用户的注册资料以及用户因享受《零碳小精灵》服务而提供的任何信息，但以下情形除外:(1)事先获得用户的明确授权或许可;(2)遵守有关法律规定，包括在国家有关机关查询时，提供用户的注册信息、用户在本小程序发布的信息内容及其发布时间、互联网地址或者域名等;(3)在紧急情况下竭力维护用户个人和社会大众的隐私安全;(4)根据本条款相关规定或者《零碳小精灵》认为必要的其他情形。《零碳小精灵》可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与《零碳小精灵》同等的保护用户隐私的责任，则《零碳小精灵》可将用户信息提供给该第三方。</view
    >
    <view
      >8.所有权及知识产权条款本小程序由《零碳小精灵》发布和运营单位拥有和运作。本小程序公开或显示的所有内容，包括但不限于文字、图表、照片、图像、动画、音效、插图及软件(简称"内容")等，均属《零碳小精灵》及其许可人或内容供应商所有。本小程序内的所有组成要素，包括但不限于整体设计及“内容"，均受商业外观、版权、道德规范、商标及其他所有相关知识产权的法律保护。除非依据本条款与条件或与《零碳小精灵》在其他协议的声明同意外，本小程序的任何部分或组成要素或"内容"均不得以任何方式复制或传播。除非有明确协议同意，否则小程序中的“内容"及一切相关权利将为《零碳小精灵》成员或其许可人的资产。</view
    >
    <view
      >9.责任限制除非另有明确的书面说明，本小程序及其所包含的或以其他方式通过本小程序提供给您的全部信息内容、材料、产品(包括软件)和服务，均是在"按现状"和"按现有"的基础上提供的。除非另有明确的书面说明，我们不对本小程序的运营及其包含在本小程序上的信息、内容、材料、产品(包括软件)或服务作任何形式的、明示或默示的声明或担保(根据中华人民共和国法律另有规定的以外)。我们不担保本小程序所包含的或以其他方式通过本小程序提供给您的全部信息内容、材料、产品(包括软件)和服务、其服务器或从本小程序发出的电子信件、信息没有病毒或其他有害成分。如因不可抗力或其他本小程序无法控制的原因使本小程序服务系统崩溃或无法正常使用导致服务不可用或网上交易无法完成或丢失有关的信息、记录等，我们会合理地尽力协助处理善后事宜。</view
    >
    <view
      >10.免责声明客户明确同意使用《零碳小精灵》服务的风险由客户承担。我们明确表示不提供任何类型的担保，不论是明确的或隐含的。我们将尽力维护客户使用《零碳小精灵》服务的合法权益，但不担保《零碳小精灵》服务一定能满足客户的要求，也不担保服务的及时性安全性、真实性、稳定性、正确性。对客户使用该等服务中出现的信息(包括但不限于客户发布的信息)删除或储存失败，我们亦不承担任何责任。客户理解并接受下载或通过相应产品服务取得的任何信息资料取决于客户自己，并自行承担系统受损、资料丢失以及其他任何风险。我们对客户在互联网上得到的任何商品购物服务等，都不作担保。我们对直接、间接、偶然、特殊及继起的损害不负责任，这些损害来自:不正当使用《零碳小精灵》服务及/或应用服务，在网上购买商品或类似服务，在网上进行交易，非法使用服务或客户传送的信息有所变动。《零碳小精灵》对本项服务下涉及的境内外基础运营商的通信网络的故障、技术缺陷、覆盖范围限制、不可抗力计算机病毒、黑客攻击、客户所在位置、客户关机或其他非《零碳小精灵》技术能力范围内的事因等造成的服务中断、客户邮件内容丢失出现乱码、错误接收、无法接收，迟延接收不承担责任。我们保留判定客户的行为是否符合本服务协议要求的权利，如果客户违背了本服务协议的规定，我们有权中止或终止相应《零碳小精灵》服务。</view
    >
    <view
      >11.协议更新及用户关注义务根据国家法律法规的更新及程序运营需要，我们有权对本条款不时地进行修改，修改后的服务条款一旦被张贴在本小程序上即生效力，并代替原来的服务条款。用户可随时登录查阅最新服务条款内容。如用户不同意更新后的服务条款，应立即停止接受本小程序提供的服务;如用户继续使用本小程序提供的服务，即视为同意更新后的用户协议。我们建议您在使用本小程序之前阅读本用户协议及本小程序的公告。如果本用户协议中任何一条被视为废止无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余协议的有效性和可执行性。</view
    >
    <view
      >12.法律管辖和适用本用户协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区现行之有效法律。如发生本服务条款的某些内容与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其他有效条款继续有效。如缔约方就本条款内容或其执行发生任何争议，双方应尽力友好协商解决;协商不成时，任何一方均可向本协议签订地有管辖权的中华人民共和国大陆地区法院提起诉讼。</view
    >
    <view
      >13.其他我们尊重用户和消费者的合法权利，本用户协议及本小程序上发布的各类规则、政策、声明等其他内容，均是为了更好地、更加便利地为用户和消费者提供服务。《零碳小精灵》欢迎用户和社会各界提出意见和建议，我们将虚心接受并适时修改本服务条款及相关政策、规则。您完成注册且成为《零碳小精灵》的注册用户则意味着您完全接受本用户协议，在注册之前请您再次确认已知悉并完全理解本用户协议的全部内容。</view
    >
  </view>
  <view class="content" v-else>
    <view
      >本协议为您与本APP管理者之间所订立的契约，具有合同的法律效力，请您仔细阅读。</view
    >
    <view>一、本协议内容、生效、变更。</view>
    <view
      >本协议内容包括协议正文及所有本小程序已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。如您对协议有任何疑问，应向本小程序咨询。您在同意所有协议条款并完成注册程序，才能成为本站的正式用户，您勾选"我已阅读并同意本小程序用户协议和法律协议"按钮后，本协议即生效，对双方产生约束力。只要您使用本小程序平台服务，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得本小程序对您问询的解答等理由，主张本协议无效，或要求撤销本协议。您确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用本小程序平台服务。本小程序有权根据需要不定期地制订、修改本协议及/或各类规则，并在本小程序平台公示，不再另行单独通知用户。变更后的协议和规则一经在网站公布，立即生效。如您不同意相关变更，应当立即停止使用本小程序平台服务。您继续使用本小程序平台服务的，即表明您接受修订后的协议和规则。</view
    >
    <view
      >二、注册资格用户须具为有法定的相应民事权利能力和行为能力的自然人、法人或其他组织，能够独立承担法律责任。您完成注册程序或其他本小程序平台同意的方式实际使用本平台服务时，即视为您确认自己具备主体资格，能够独立承担法律责任。若因您不具备主体资格，而导致的一切后果，由您及您的监护人自行承担。</view
    >
    <view
      >2.1用户应自行诚信向本站提供注册资料，用户确保其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且本小程序保留
      终止用户使用本平台各项服务的权利。</view
    >
    <view
      >2.2用户在本站进行浏览等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。为完成创建账号，用户需提供以下信息:用户的姓名、身份证号、密码、户籍地址、家庭住址、手机号等信息。
      用户提供的上述信息，将在用户使用本服务期间持续授权我们使用。在用户注销账号时，我们将停止使用并删除上述信息。上述信息将存储于中华人民共和国境内。如需跨境传输，我们将会单独征得用户的授权同意。</view
    >
    <view>三.账户</view>
    <view
      >3.1您注册成功后，即成为本小程序平台的用户，将持有本小程序平台唯一编号的账户信息，您可以根据本站规定改变您的密码。</view
    >
    <view
      >3.2您设置的姓名为真实姓名，不得侵犯或涉嫌侵犯他人合法权益。否则，本小程序有权终止向您提供服务，注销您的账户。账户注销后，相应的用户名将开放给任意用户注册登记使用。</view
    >
    <view
      >3.3您应谨慎合理地保存、使用您的会员名和密码，应对通过您的会员名和密码实施的行为负责。除非有法律规定或司法裁定，且征得本小程序的同意，否则，会员名和密码不得以任何方式转让、赠与或继承(与
      账户相关的财产权益除外)。</view
    >
    <view
      >3.4用户不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。</view
    >
    <view
      >3.5如果发现任何非法使用等可能危及您的账户安全的情形时，您应当立即以有效方式通知本小程序要求暂停相关服务并向公安机关报案。您理解本小程序对您的请求采取行动需要合理时间，本小程序对在采取行动前已经产生的后果(包括但不限于您的任何损失)不承担任何责任。</view
    >
    <view>四.用户信息的合理使用</view>
    <view
      >4.1您同意本小程序平台拥有通过邮件、短信电话等形式，向在本站注册用户发送信息等告知信息的权利。</view
    >
    <view
      >4.2您了解并同意，本小程序有权应国家司法、行政等主管部门的要求，有权向其提供您在本小程序平台填写的注册信息和交易记录等必要信息。如您涉嫌侵犯他人知识产权，则本小程序亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。</view
    >
    <view
      >4.3用户同意本小程序有权使用用户的注册信息、用户名、密码等信息，登录进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。</view
    >
    <view>五、免责条款</view>
    <view
      >本平台仅提供信息对接，发生一切纠纷问题皆与本平台无关，请通过仲裁部门维护各自权益。</view
    >
    <view
      >六、争议解决如用户与本小程序之间发生争议，应首先通过友好协商解决;协商无果的，可向有关部门投诉或提起法律诉讼。本小程序将积极配合相关部门对争议进行调查和处理，并采取必要措施维护用户的合法权益。本小程序将积极听取用户的意见和建议，不断改进服务，确保用户合法权益得到充分保障。</view
    >
  </view>
</template>

<script setup lang="ts">
let props = defineProps<{ index: number }>();
</script>

<style lang="scss" scoped>
.title {
  text-align: center;
  font-family: PingFangSC, PingFang SC;
  font-weight: 400;
  font-size: 48rpx;
}
.content {
  margin-top: 24rpx;
  height: 600rpx;
  overflow: auto;
  font-family: PingFangSC, PingFang SC;
  font-weight: 400;
  font-size: 28rpx;
  > view {
    margin-bottom: 24rpx;
  }
}
</style>
