<template>
  <view class="page-content">
    <view class="page-content-title"
      >工信部：到2027年发布并实施100项以上绿色低碳标准</view
    >
    <view class="page-content-source">资料来源：中国金属学会官网</view>
    <view class="page-content-content"
      >2024年12月17日，我国工信部举行"标准提升引领原材料工业优化升级"新闻发布会．介绍了《标准提升引领原材料工业优化升级行动方案（2025-2027年）》（下称《行动方案》）有关情况，以及钢铁行业今年巩固去产能成果工作情况和下一步要发力的3项举措。
      会议介绍，《行动方案》以标准体系建设为切入口和发力点，提出了开展标准体系优化建设、加快数字化转型标准研制、推进绿色低碳标准建设、加强新材料产品标准培育等多项重点工作任务，引领原材料工业供给高端化、结构合理化、发展绿色化、产业数字化、体系安全化发展。
      具体来看，在高端化发展上，《行动方案》明确制定一批通用性强的先进基础材料标准：推动一批创新成果转化成关键战略材料标准，聚焦前沿材料产业化重点发展指导目录开展前沿新材料标准研制，到2027年发布并实施100项以上新材料标准。在智能化发展上，《行动方案》部署数字技术与原材料工业深度融合相关标准制定、修订任务，到2027年发布并实施200项以上数字化转型标准。在绿色化发展上《行动方案》明确开展电炉短流程炼钢、氢冶金、绿电一绿氢一石化耦合等技术标准研制，开展重点行业碳排放、重点产品碳足迹核算方法等标准研制，开展绿色建材、生物基材料等产品标准及绿色园区、绿色工厂评价标准研制，到2027年发布并实施100项以上绿色低碳标准。
      会议还介绍，为巩固钢铁行业去产能成果今年开展了4个方面工作。一是落实钢铁行业产能置换政策。结合行业"减量提质"发展的新形势新要求印发了暂停钢铁产能置换工作的通知，工信部目前正在会同有关方面组织修订钢铁产能置换办法。二是实施粗钢产量宏观调控，坚持以节能降碳为重点区分情况、有保有压、分类指导、扶优汰劣。组织开展2024年度全国粗钢产量调控工作。三是强化行业规范管理，包括组织修订钢铁行业规范条件，研究建立分级分类管理体系，强化政策联动，引导要素资源进一步向优势企业集聚，加速淘汰市场竞争力弱的企业。四是积极推进设备更新和改造升级包括制定出台钢铁行业设备更新和技术改造指南，利用专项再贷款等政策支持行业绿色化、数字化转型，有关协会、企业积极开展行业自律。
      下一步，工信部将会同有关部门通过3项举措持续巩固去产能成果。一是组织开展钢铁行业"十五五"发展规划研究，全面分析钢铁行业发展面临的新形势聚焦高质量发展首要任务和新型工业化关键任务，系统谋划"十五五"时期钢铁行业发展的总体目标、重点任务和政策举措。二是加快修订出台钢铁行业产能置换实施办法，坚持"控总量、优存量、促升级"政策导向，进一步优化完善差别化产能置换政策，促进行业组织结构、布局结构优化和"减量提质"发展。三是抓紧开展钢铁行业规范管理工作，实施分级分类管理遴选一批引领型规范企业，引导企业向高端化、智能化、绿色化、高效化、安全化转型升级。</view
    >
  </view>
</template>

<script setup lang="ts">
import { ref } from "vue";
</script>

<style scoped lang="scss">
.page-content {
  padding: 40rpx;
  width: calc(100% - 80rpx);
  min-height: calc(100% - 80rpx);
  background: #f1f8ff;
  &-title {
    font-family: PingFangSC, PingFang SC;
    font-weight: 400;
    font-size: 36rpx;
    color: #137708;
    text-align: center;
    padding: 10rpx;
  }
  &-source {
    font-family: PingFangSC, PingFang SC;
    font-weight: 400;
    font-size: 28rpx;
    color: rgba(0, 0, 0, 0.65);
    text-align: center;
    margin-bottom: 30rpx;
  }
  &-content {
    font-family: PingFangSC, PingFang SC;
    font-weight: 400;
    font-size: 28rpx;
    color: rgba(0, 0, 0, 0.65);
  }
}
</style>
