<template>
  <view class="rule-content">
    <p>一、积分获取规则</p>
    <ol>
      <li>
        1.1 每日签到<br />
        规则：每日登录限完成1次签到<br />
        积分规则：每日签到成功，固定发放1积分
      </li>
      <li>
        1.2 活动打卡<br />
        规则：每个活动点每日限完成1次打卡。<br />
        积分奖励：每次签到成功，根据规则发放不同额度的积分。
      </li>
      <li>
        1.3 答题任务<br />
        规则：每个打卡点每日限完成1次答题任务，题目为低碳知识选择题。<br />
        积分奖励：回答正确：发放 10积分。回答错误：发放1积分，并显示低碳知识小贴士。<br />
        限制：同一打卡点每日仅限答题1次。
      </li>
      <li>
        1.4 浏览图文<br />
        规则：每个打卡点每日限完成1次图文浏览任务，需连续阅读园区宣传图文满15秒。<br />
        积分奖励：浏览完成后，自动发放 10 积分。<br />
        限制：中途退出或切换页面将重新计时。同一打卡点每日仅限完成1次。
      </li>
    </ol>
    <p>二、积分消耗规则</p>
    <ol>
      <li>
        2.1兑换电子勋章碎片<br />
        规则：每个电子勋章碎片需消耗规定积分。<br />
        说明：电子勋章兑换后积分不可退回。
      </li>
      <li>
        兑换实物勋章兑换券<br />
        规则：无需额外消耗积分，仅需集齐规定个数电子勋章即可兑换。<br />
        说明：兑换券仅限在园区指定地点核销，核销后状态更新为“已使用”。
      </li>
    </ol>
    <p>三、积分变动记录</p>
    <p>查看路径：</p>
    <p>
      进入「勋章展示页面」→ 点击顶部「当前积分」→ 查看积分明细。<br />
      获取记录：任务名称、时间、积分值<br />
      排序方式：默认按时间倒序排列。
    </p>
    <p>四、积分使用限制</p>
    <p>有效期：积分永久有效，不清零。</p>
    <p>防作弊机制：系统自动检测异常行为（如频繁切换页面刷浏览任务、重复答题等），一经核实将取消当日积分并警告用户。</p>
    <p>五、其他说明</p>
    <p>排行榜更新：</p>
    <p>积分排行榜每小时更新一次，仅展示前10名用户的实时数据。</p>
    <p>争议处理：如对积分变动有异议，可通过「我的」→「反馈与建议」提交申诉，工作人员将在24小时内处理。</p>
    <p>活动调整：</p>
    <p>积分规则可能因运营活动临时调整，调整前将通过小程序公告通知用户。</p>
    <p>附：积分与勋章兑换示例表</p>
  </view>
</template>
<script setup lang="ts"></script>
<style scoped lang="scss">
.rule-content {
  padding: 20rpx;
  background: #f1f8ff;
}
</style>
